import '../keys.dart';

const Map<String, String> arabicTranslationsMap = {
  TranslationsKeys.appName: 'IDB',
  TranslationsKeys.tkApiError: 'خطأ',
  TranslationsKeys.tkNetworkError: 'خطأ في الشبكة',
  TranslationsKeys.tkFetchingError: 'خطأ في جلب البيانات',
  TranslationsKeys.tkError: 'خطأ',
  TranslationsKeys.tkSomethingWentWrongMsg: 'حدث خطأ ما',
  TranslationsKeys.tkNoInternetMsg: 'لا يوجد اتصال بالإنترنت',
  TranslationsKeys.tkNoInternetTryAgainMsg: 'لا يوجد اتصال بالإنترنت، يرجى المحاولة مرة أخرى',
  TranslationsKeys.tkCheckNetworkFailedMsg: 'فشل في التحقق من حالة الشبكة',
  TranslationsKeys.tkHomePage: 'الرئيسية',
  TranslationsKeys.tkLoginPage: 'تسجيل الدخول',
  TranslationsKeys.tkRegisterPage: 'التسجيل',
  TranslationsKeys.tkChooseLanguage: 'اختر اللغة',

  /// وحدة المصادقة - صفحة تسجيل الدخول
  TranslationsKeys.tkLoginWelcomeMsg: 'مرحبًا بك في بنك التنمية الصناعية',
  TranslationsKeys.tkUsernameLabel: 'اسم المستخدم',
  TranslationsKeys.tkUsernameRequiredMsg: 'اسم المستخدم مطلوب',
  TranslationsKeys.tkPasswordLabel: 'كلمة المرور',
  TranslationsKeys.tkCurrentPasswordLabel: 'كلمة المرور الحالية',
  TranslationsKeys.tkNewPasswordLabel: 'كلمة المرور الجديدة',
  TranslationsKeys.tkConfirmNewPasswordLabel: 'تأكيد كلمة المرور',
  TranslationsKeys.tkPasswordRequiredMsg: 'كلمة المرور مطلوبة',
  TranslationsKeys.tkForgetPasswordLabel: 'نسيت كلمة المرور؟',
  TranslationsKeys.tkSignInBtn: 'تسجيل الدخول',
  TranslationsKeys.tkNoAccountLabel: 'ليس لديك حساب؟',
  TranslationsKeys.tkNoDataLabel: 'لا توجد بيانات',
  TranslationsKeys.tkRegisterNowLabel: 'سجل الآن',
  TranslationsKeys.tkAboutUsLabel: 'من نحن',
  TranslationsKeys.tkAboutUsContent:
      'بنك التنمية الصناعية هو أحد المؤسسات المالية الرائدة في السودان التي قدمت ومارست الخدمات المصرفية الإسلامية. تم تأسيسه في سبتمبر 1981 ولعب دورًا مهمًا في تشكيل المشهد المالي للبلاد من خلال تقديم حلول مصرفية متوافقة مع الشريعة الإسلامية. على مدار السنوات، وسّع البنك خدماته لتشمل قطاعات التجارة والاستثمار والتمويل التنموي، مما يضمن الشمول المالي والنمو الاقتصادي. مع التزام قوي بالابتكار والخدمات التي تركز على العميل، يواصل البنك دعم الشركات والأفراد مع الالتزام بمبادئ التمويل الإسلامي.',
  TranslationsKeys.tkTermsContent: """
شروط وأحكام إستخدام خدمة الدفع عبر الموبايل
.1بند التعريفات:
تكون للعبارات الواردة في وثيقة الأحكام والشروط المعاني والتفسيرات الآتية: 1.1البنك المركزي: يقصد به بنك السودان المركزي.
1.2مقدم الخدمة: يقصد به مصرف التنمية الصناعية.
1.3العميل: يقصد به الشخص الذي يمتلك حساب إلكتروني بالنظام وت ّم تسجيله وفقاً لوثيقة الأحكام والشروط.
1.4الخدمة: يقصد بها خدمة الدفع عبر الموبايل المق ّدمة من مقدم الخدمة ت ّمكن العميل بموجبها
القيام بعدد من المعاملات المشار إليها في الفقرة 5.4 أدناه.
1.5الخدمة المصرفية عبر الموبايل: يقصد بها خدمة الدفع عبر الموبايل وذلك بقيام العميل بتحويل الأموال عبر الموبايل بإستخدام حسابه المصرفي طرف مقدم الخدمة.
1.6الحكومة: يقصد بها حكومة جمهورية السودان.
1.7الوثيقة: يقصد بها الشروط والأحكام المض ّمنة في هذه الوثيقة و/أو ملاحقها و/أو تعديلاتها
اللاحقة.
1.8الحساب المصرفي: يقصد به حساب العميل طرف مقدم الخدمة يمتلكه العميل بعد إستيفاء متطلبات فتح الحسابات المصرفية المعمول بها لدى مقدم الخدمة والبنك المركزي. 1.9التسجيل في الخدمة: يقصد به إدخال العميل لبياناته الشخصية والتسجيل بالنظام بغرض
الحصول على الخدمة وفق شروط وأحكام هذه الوثيقة ومتطلبات التسجيل التي يحددها مقدم الخدمة من وقت لأخر.
1.10رمز التعريف الشخصي: يقصد به الرقم الذي يخصص لكل عميل بمجرد تسجيله تسجيلاً صحيحاً بالنظام وحصوله على حساب إلكتروني بغرض الحصول على الخدمة.
1.11حساب إلكتروني: يقصد به حساب خدمة الدفع عبر الموبايل وهو حساب مخزون القيمة بنقود إلكترونية يمتلكه العميل في النظام.
1.12النظام: يقصد به النظام الخاص بخدمة الدفع عبر الموبايل التابع لمزود الخدمة.
1.13شركات الإتصالات: يقصد بها شركات الإتصالات المعت ّمدة والمر ّخص لها بالعمل في السودان من الهيئة القومية للإتصالات بموجب القوانين السارية.
1.14الهيئة: يقصد بها الهيئة القومية للإتصالات.
1.15مركز خدمة العملاء: يقصد به رقم الإتصال الموحد التابع لمقدم الخدمة والمخصص للإستجابة لإستفسارات العملاء حول خدمة الدفع عبر الموبايل وحل المشاكل الفنية التي تواجه العميل.
1.16غسيل الأموال وتمويل الإرهاب: يقصد بها الأنشطة المحددة في قانون مكافحة غسل الأموال وتمويل الإرهاب لسنة 2010 واللوائح والاوامر التي تصدر بموجبه من الوزير و/أو من وحدة
￼
التحريات المالية.
1.17المعاملات: يقصد بها العمليات التي يقوم بها العميل بغرض الحصول على الخدمات الواردة في الفقرة 5.4 أدناه.
1.18مزود الخدمة: يقصد به شركة الخدمات المصرفية المحدودة أحد الشركات التابعة للبنك
المركزي.
1.19الرسوم: يقصد بها الرسوم التي تفرض على الخدمة بواسطة الجهات الرسمية ويتم خصمها من الحساب الإلكتروني الخاص بالعميل بواسطة مقدم الخدمة.
1.20العمولة: يقصد بها مبلغ من المال يتم خصمه بواسطة مقدم الخدمة من الحساب الإلكتروني
الخاص بالعميل كمقابل لتقديم الخدمة.
.2تاريخ بدء الخدمة:
تبدأ الخدمة من تاريخ قبول تسجيل العميل بالنظام مالم يتم إنهاء تقديم الخدمة وفقاً لشروط وأحكام هذه الوثيقة.
.3طريقة التسجيل في الخدمة:
عند دخول العميل بالنظام بغرض الحصول على الخدمة وإنشاء حساب إلكتروني بالنظام وبموافقته على كافة الشروط والأحكام يتم تسجيل العميل بالنظام ويكون هذا بمثابة إقرار منه بقراءة وإطلاع العميل على الشروط والأحكام وعلمه بمحتواها وموافقته عليها.
.4متطلبات التسجيل وإستخدام الخدمة:
4.1أن يكون العميل من العملاء المس ّجلين لدي مصرف التنمية الصناعية و لديه حساب وفقاً لضوابط فتح الحساب من قبل البنك المركزي
4.2إنشاء العميل لحساب إلكتروني بتطبيق الموبايل بغرض الحصول على الخدمة.
4.3حصول العميل علي رمز التعريف الشخصي خاص به.
4.4أي متطلبات أخرى يحددها مقدم الخدمة من وقت لأخر.
.5طريقة إستخدام الخدمة:
5.1عند موافقة تسجيل العميل بالنظام سوف يقوم العميل بإدخال رمز التعريف الشخصي الخاص
بالعميل، ويلتزم العميل باتخاذ كافة الإجراءات الأمنية اللازمة لحماية رمز التعريف الشخصي وهاتف العميل السيار وشريحته الخاصة بالعميل.
5.2في حال قام العميل بتزويد طرف ثالث برمز التعريف الشخصي تكون المعاملات بالنظام قد تمت بصورة صحيحة ويكون العميل مسئولاً عن كافة المعاملات التي تتم عن طريق الطرف الثالث بواسطة الحساب الإلكتروني الخاص بالعميل دون أدنى مسئولية على مقدم الخدمة.
5.3في حال فقدان العميل لهاتفه السيار و/أو ت ّم الإستيلاء عليه بواسطة أي شخص ثالث، على العميل إتخاذ الإجراءات القانونية لقفل الحساب و قفل الشريحة وفقاً للإجراءات المتبعة في مثل هذه الحالة، ويكون العميل وحدة المسئوول عن أي معاملات يتم إجراءاها في الفترة ما بين فقدان الهاتف
السيار حتى يتم قفل الحساب و الشريحة بواسطة شركة الإتصالات.
5.5إذا ت ّم إدخال رمز التعريف الشخصي أكثر من ثلاث مرات بشكل خاطئ سوف يتم تعليق الحساب الإلكتروني تلقائياً بالنظام وفي حال رغب العميل في إعادة تفعيل الخدمة يجب عليه الإتصال بمركز خدمة عملاء المشتركين التابع لمقدم الخدمة او زيارة اقرب فرع.
.6التعهدات والإقرارات:
يقر ويتعهد العميل لمقدم الخدمة بالأتي:
6.1يقر يوافق العميل على أن يكون خاضعاً وملزماً للشروط والأحكام الواردة بهذه الوثيقة وكل التعديلات التي تتم عليها من وقت لآخر بواسطة مقدم الخدمة دون إخطار مسبق للعميل بهذه التعديلات، كما يكون العميل خاضعاً للضوابط والمنشورات التي تصدر عن البنك المركزي وضوابط نظام الدفع عبر الموبايل وفقاً للمنشور الصادر بالرقم 2016/9 وتعديلاته التي تتم من وقت لآخر.
6.1.1يكون العميل مسؤولاً عن جميع العمليات المصرفية التي يتم إجرائها عبر الموبايل بإستخدام الخدمة المصرفية عبر الموبايل ويلتزم العميل بالإحتفاظ برمز التعريف الشخصي بصورة آمنة، كما يلتزم العميل بإخطار مقدم الخدمة فوراً في حال ضياع أو فقدان أو سرقة رمز التعريف الشخصي أو الإطلاع بواسطة شخص ثالث، وفي هذه الحالة لايكون مقدم الخدمة مسؤولاً عن أي عملية تتم عبر الموبايل عن طريق إستخدام رمز التعريف الشخصي حتى يتم إخطاره.
6.2أن المعلومات المقد ّمة بالنظام بغرض إنشاء الحساب الإلكتروني والحصول على الخدمة هي معلومات صحيحة وحقيقية ويتعهد العميل بتوفير والإفصاح عن أي معلومات مطلوبة بواسطة مقدم الخدمة من وقت لآخر بهدف إستمرارية الخدمة.
6.3يعفي العميل مقدم الخدمة من أي مسئولية عند إستخدام المعلومات التي أفصح عنها العميل بغرض إستخدام الخدمة عبر النظام وإجراء المعاملات.
6.4يوافق ويقر العميل بمنح الإذن لمقدم الخدمة للوصول لقائمة الأسماء، الإستديو، الكاميرا وموقع العميل الجغرافي المخزنة بالهاتف السيار وذلك بغرض حصول العميل على بعض الخدمات المتاحة بالنظام، وبهذا يعفي العميل مقدم الخدمة عن أي مسئولية قانونية جراء قيام مقدم الخدمة من إستخدام المعلومات بغرض تمتع العميل بالخدمات المتاحة بالنظام.
6.5يلتزم ويتعهد العميل بجميع القوانين والأنظمة والقواعد واللوائح أو التعليمات المعمول بها و التوجيهات الصادرة من السلطات المختصة المتعلقة بهذه الخدمة.
6.5.1يكون العميل مسؤولاً عن جميع العمليات التي يتم إجرائها عبر الخدمة بإستخدام الحساب الإلكتروني ورمز التعريف الشخصي الخاص بالعميل ويلتزم العميل بالإحتفاظ بالحساب الإلكتروني ورمز التعريف الشخصي بصورة آمنة، لايكون مقدم الخدمة مسؤولاً عن أي عملية تتم عن طريق إستخدام الحساب الإلكتروني ورمز التعريف الشخصي بواسطة طرف ثالث.
6.6يتعهد العميل بعدم إستخدام الخدمة في أي نشاطات غير قانونية و/أو مخالفة للقوانين.
6.7يقر ويوافق العميل ويعلم بأن إستخدام الخدمة عبر النظام خاضع لشروط مزود الخدمة والسلطات التنظيمية والرقابية أو حكومية أخرى والتي تصدر من وقت لآخر.
6.8يعفي العميل مقدم الخدمة من أي مطالبة و/أو مسئولية جراء إيقاف و/أو توقيف الخدمة بسبب يرجع لمزود الخدمة ناتج عن أي أعطال في الشبكة أو أية أسباب أخرى خاصة بمزود الخدمة تؤدي إلى توقف الخدمة.
6.9يقر ويوافق العميل بأن يكون مسئولاً عن إختيار الخدمة وليس علي مقدم الخدمة أية مسؤلية جنائية أو مدنية أو تقصيرية تنتج عن تسجيل العميل في الخدمة.
6.10مقدم الخدمة يتعهد ببذل العناية الواجبة في حصول العملاء علي أفضل خدمة ممكنة ومع ذلك فان مقدم الخدمة غير مسؤول عن أي خلل أو بطء في الخدمة أو توقف للخدمة ناتج عن وجود خلل أو ضعف أو توقف في شبكة الإتصالات العامة بسبب المناخ أو الصيانة أو التضاريس الجوية أو موقع العميل الجغرافي وحالات الحرب أو القوة القاهرة التي لا يد أو سيطرة لمقدم الخدمة فيها كالحصار أو الشغب و الاضطرابات او الاعصارات أو الفيضانات.
6.11يق ّر العميل بأنّه يحق لمقدم الخدمة وقف الخدمة في أ ّي وقت وذلك بدون إبداء الأسباب لهذا ً
الإجراء وبدون إشعار العميل مسبقا.
6.12يوافق العميل بأنه يح ّق لمقدم الخدمة قفل و/أو إيقاف الحساب الإلكتروني في حال تم
إستخدامه بصورة غير قانونية وبالمخالفة لأحكام وشروط هذه الوثيقة، ويتم دفع الرصيد القائم في الحساب الإلكتروني –إن وجد- للعميل بحسب الإجراءات المت ّبعة التي يحددها مقدم الخدمة من وقت لآخر، وذلك بعد خصم كـافة المبالغ المستحقة لمقدم الخدمة على العميل.
6.12.1يق ّر العميل أ ّن مقدم الخدمة غير مسؤول في حال لم يتمكن العميل من الوصول لخدمة البنك المصرفية عبر الموبايل بسبب عطل في الشبكة أو إنقطاع التيار الكهربائي أو بسبب أ ّي إضطرابات عامة أو بسبب الحجز على حساب العميل بواسطة محكمة أو أ ّي جهة مختصة لها سلطة الحجز على حساب العميل بموجب القانون أو بسبب الحجز على حساب العميل أو دمج حسابات العميل بواسطة البنك لتسوية مديونية قائمة على العميل للبنك.
6.12.2مع مراعاة أحكام وشروط هذه الوثيقة، يحق للعميل إستلام المبالغ المودعة بالحساب الإلكتروني عبر أي من فروع مصرف التنمية الصناعية او وكلاء مقدم الخدمة المعتمدين والمعنين عنهم من قبل مقدم الخدمة.
.7حدود المسؤولية:
لمقدم الخدمة الحق في إيقاف و/أو توقيف الخدمة عن العميل فوراً وإيقاف المعاملات دون إخطار العميل في الحالات الآتية:
7.1في حال ت ّم إيقاف الخدمة بقرار من مزود الخدمة وأو أي من الجهات القضائية و/أو البنك المركزي و/أو أي من الجهات الرسمية.
7.2في حالة الإشتباه في إستخدام و/أو إستغلال الخدمة في أنشطة مخالفة للقانون أو أنشطة تتعلق بغسيل الأموال و/أو تمويل الإرهاب أو تم ّ إستخدام الخدمة بما يخالف شروط وأحكام هذه الوثيقة.
7.4في حال ت ّم إساءة إستخدام الخدمة من قبل العميل و/أو أي طرف ثالث أو ت ّم إستخدام الخدمة في نشاطات غير قانونية و/أو نشاطات مخالفة للقوانين وبهذا يحق لمقدم الخدمة إتخاذ الإجراءات القانونية اللازمة.
7.5يوافق العميل بأنه يحق لمقدم الخدمة وقف الخدمة بواسطة مقدم الخدمة بدون إبداء الأسباب ً
لهذا الإجراء وبدون إشعار العميل مسبقا.
7.6يتعهد ويوافق العميل بإعفاء مقدم الخدمة عن أية مسؤلية جنائية و/أو مدنية و/أو تقصيرية في حال تم فقدان و/أو سرقة الحساب الإلكتروني ورمز التعريف الشخصي الخاص بحساب الخدمة.
7.8يقر ويوافق العميل بتحمله أي رسوم و/أو ضرائب و/أو عمولة تفرض على الخدمة من قبل الحكومة أو الجهات الرسمية وبهذا يفوض العميل مقدم الخدمة بالخصم من الحساب الإلكتروني الخاص بالعميل أي رسوم أو عمولات مفروضة على الخدمة من قبل الجهات الرسمية و/أو من مقدم الخدمة.
.8أحكام عامة:
8.1.1تخضع هذه البنود والشروط وتفسر وفقاً للقوانين السودانية والضوابط الصادرة من البنك
المركزي الخاصة بخدمات الدفع عبر الموبايل وتخضع للإختصاص القضائي الحصري للمحاكم السودانية،
8.2هذه الوثيقة لا تشكل أي علاقة عمل أو وكالة بين مقدم الخدمة والعميل.
8.3في حال أصدرت المحكمة أي قرار يقضي ببطلان بعض شروط وأحكام هذه الوثيقة تظل بقية البنود والأحكام صحيحة وسارية.
8.4تكون وثيقة الشروط والأحكام خاضعة للشروط التي الصادرة من مزود الخدمة من وقت لآخر.
8.5هذا التعهد نهائى من قبل العميل و غير قابل للنقض.""",
  TranslationsKeys.tkBranchesLabel: 'الفروع',
  TranslationsKeys.tkContactUsLabel: 'اتصل بنا',
  TranslationsKeys.tkWebsiteLabel: 'الموقع الإلكتروني',

  /// وحدة المصادقة - صفحة التسجيل
  TranslationsKeys.tkRegisterWelcomeMsg: 'سجل حساب جديد',
  TranslationsKeys.tkRegisterSuccessMsg: 'تم إنشاء الحساب بنجاح، يرجى التحقق من رقم هاتفك',
  TranslationsKeys.tkNationalNumberLabel: 'الرقم الوطني',
  TranslationsKeys.tkNationalNumberRequiredMsg: 'الرقم الوطني مطلوب',
  TranslationsKeys.tkRimLabel: 'رقم الحساب (RIM)',
  TranslationsKeys.tkRimRequiredMsg: 'رقم الحساب مطلوب',
  TranslationsKeys.tkPhoneLabel: 'رقم الهاتف',
  TranslationsKeys.tkPhoneRequiredMsg: 'رقم الهاتف مطلوب',
  TranslationsKeys.tkPhoneNotValidMsg: 'يجب أن يكون رقم الهاتف صحيحًا',
  TranslationsKeys.tkSignUpBtn: 'تسجيل',
  TranslationsKeys.tkHaveAccountLabel: 'هل لديك حساب بالفعل؟',
  TranslationsKeys.tkIAgreeLabel: 'اوافق على',
  TranslationsKeys.tkTermsAndConditions: 'الشروط والاحكام',
  TranslationsKeys.tkTermsAndConditionsRequiredMsg: 'يجب الموافقة على الشروط والاحكام لإنشاء حساب جديد',
  TranslationsKeys.tkLoginNowLabel: 'تسجيل الدخول الآن',
  TranslationsKeys.tkLinkAccountsLabel: 'ربط الحسابات',
  TranslationsKeys.tkLinkAccountsDescription: 'حدد الحسابات التي تريد ربطها بهذا المستخدم',
  TranslationsKeys.tkLinkAccountsSuccessMsg: 'تم ربط الحسابات بنجاح',
  TranslationsKeys.tkPasswordSetWelcomeMsg: 'يرجى تعيين كلمة المرور الخاصة بك',
  TranslationsKeys.tkPasswordSetSuccessMsg: 'تم تعيين كلمة المرور بنجاح',

  /// وحدة المصادقة - إعادة تعيين كلمة المرور
  TranslationsKeys.tkPasswordResetWelcomeMsg: 'إعادة تعيين كلمة المرور القديمة',
  TranslationsKeys.tkPasswordResetBtn: 'إعادة تعيين كلمة المرور',
  TranslationsKeys.tkOrLabel: 'أو',
  TranslationsKeys.tkContactCustomerServiceBtn: 'الاتصال بخدمة العملاء',
  TranslationsKeys.tkBackToLogin: 'العودة إلى تسجيل الدخول',
  TranslationsKeys.tkResetDeviceWelcomeMsg: 'يرجى إدخال الرمز الذي تلقيته على هاتفك لاستخدام حسابك على هذا الجهاز',
  TranslationsKeys.tkResetDeviceBtn: 'إعادة ضبط الجهاز',
  TranslationsKeys.tkOtpLabel: 'رمز التحقق',
  TranslationsKeys.tkOtpRequiredMsg: 'الرمز مطلوب',
  TranslationsKeys.tkResetDeviceSuccessMsg: 'تمت إعادة ضبط الجهاز بنجاح',
  TranslationsKeys.tkSecurityQuestionsWelcomeMsg: 'يرجى الإجابة على هذه الأسئلة لإعادة تعيين كلمة المرور',
  TranslationsKeys.tkAnswerLabel: 'الإجابة',
  TranslationsKeys.tkAnswerRequiredLabel: 'الإجابة مطلوبة',
  TranslationsKeys.tkResetPasswordWelcomeMsg: 'أدخل كلمة المرور الجديدة للوصول إلى حسابك',
  TranslationsKeys.tkResetPasswordSuccessMsg: 'تمت إعادة تعيين كلمة المرور بنجاح',
  TranslationsKeys.tkChangePasswordLabel: 'تغيير كلمة المرور',
  TranslationsKeys.tkChangePasswordWelcomeMsg: 'أدخل كلمة المرور القديمة والجديدة لتغييرها',
  TranslationsKeys.tkChangePasswordValidationErrorMsg: 'كلمة المرور الجديدة وتأكيد كلمة المرور غير متطابقين',
  TranslationsKeys.tkChangePasswordSuccessMsg: 'تم تغيير كلمة المرور بنجاح',
  TranslationsKeys.tkSecurityQuestionsLabel: 'أسئلة الأمان',
  TranslationsKeys.tkChangeSecurityQuestionsLabel: 'تغيير أسئلة الأمان',
  TranslationsKeys.tkChangeSecurityQuestionsWelcomeMsg: 'قم بتغيير إجاباتك وأرسلها لحفظ الإجابات الجديدة',
  TranslationsKeys.tkChangeSecurityQuestionsValidationErrorMsg: 'بعض الإجابات مفقودة',
  TranslationsKeys.tkChangeSecurityQuestionsSuccessMsg: 'تم تحديث أسئلة الأمان بنجاح',

  TranslationsKeys.tkConfirmBtn: 'تأكيد',
  TranslationsKeys.tkVerifyAccountWelcomeMsg: 'يرجى إدخال الرمز الذي تلقيته على هاتفك للتحقق من حسابك',
  TranslationsKeys.tkVerifyAccountSuccessMsg: 'تم التحقق من الحساب بنجاح',
  TranslationsKeys.tkVerifyBtn: 'تحقق',
  TranslationsKeys.tkWelcomeLabel: 'مرحبًا',
  TranslationsKeys.tkBalanceLabel: 'الرصيد',
  TranslationsKeys.tkAccountNoLabel: 'رقم الحساب',
  TranslationsKeys.tkIbanLabel: 'رقم الحساب الدولي (IBAN)',
  TranslationsKeys.tkAccountCopiedSuccessMsg: 'تم نسخ تفاصيل الحساب',
  TranslationsKeys.tkInfoLabel: 'معلومات',
  TranslationsKeys.tkMyAccountsLabel: 'حساباتي',

  /// خدمات البنك - التحويلات المالية
  TranslationsKeys.tkServicesLabel: 'الخدمات',
  TranslationsKeys.tkBeneficiariesLabel: 'المستفيدين',
  TranslationsKeys.tkAddBeneficiaryLabel: 'اضافة الى المستفيدين',
  TranslationsKeys.tkTypeLabel: 'النوع',
  TranslationsKeys.tkTeleProviderLabel: 'مقدم الخدمة',
  TranslationsKeys.tkTeleServiceTypeLabel: 'نوع الرقم',
  TranslationsKeys.tkAddBeneficiarySuccessMsg: 'تم اضافة المستفيد بنجاح',
  TranslationsKeys.tkNoBeneficiariesLabel: 'ليس لديك مستفيدين حاليا',
  TranslationsKeys.tkBeneficiaryExistMsg: 'لا يمكن اضافة نفس المستفيد اكثر من مرة',
  TranslationsKeys.tkTransferServicesLabel: 'التحويلات',
  TranslationsKeys.tkTransferOutsideBankServicesLabel: 'تحويل بنوك اخرى',
  TranslationsKeys.tkTransferInsideBankLabel: 'تحويل داخل البنك',
  TranslationsKeys.tkTransferBetweenMyAccountsLabel: 'بين حساباتي',
  TranslationsKeys.tkTransferWithQRLabel: 'مسح QR',
  TranslationsKeys.tkScanQrCodeLabel: 'مسح رمز QR',
  TranslationsKeys.tkFromAccountLabel: 'من الحساب',
  TranslationsKeys.tkToAccountLabel: 'إلى الحساب',
  TranslationsKeys.tkToAccountBBANLabel: 'إلى الحساب (BBAN)',
  TranslationsKeys.tkAmountLabel: 'المبلغ',

  // 🏦 خدمات البنك - خدمات التحويل
  TranslationsKeys.tkGeneralRequiredMsg: 'هذا الحقل مطلوب',
  TranslationsKeys.tkToAccountTypeLabel: 'نوع الحساب المستلم',
  TranslationsKeys.tkCommentsLabel: 'التعليقات',
  TranslationsKeys.tkOneAccountErrorMsg: 'لديك حساب واحد فقط',
  TranslationsKeys.tkLinkedAccounts: 'الحسابات المرتبطة',
  TranslationsKeys.tkAccountTypeLabel: 'نوع الحساب',
  TranslationsKeys.tkTransactionInfoLabel: 'معلومات المعاملة',
  TranslationsKeys.tkReceiverNameLabel: 'اسم المستلم',
  TranslationsKeys.tkSDGLabel: 'جنيه سوداني',

  // 📑 خدمات البنك - كشف الحساب
  TranslationsKeys.tkStatementServiceLabel: 'كشف الحساب',
  TranslationsKeys.tkHistoryServiceLabel: 'السجل',
  TranslationsKeys.tkCancelLabel: 'إلغاء',
  TranslationsKeys.tkCloseLabel: 'اغلاق',
  TranslationsKeys.tkSelectDateLabel: 'اختر التاريخ',
  TranslationsKeys.tkDateLabel: 'التاريخ',
  TranslationsKeys.tkFromLabel: 'من',
  TranslationsKeys.tkToLabel: 'إلى',
  TranslationsKeys.tkTransactionsLabel: 'المعاملات',
  TranslationsKeys.tkLast5Label: 'آخر 5',
  TranslationsKeys.tkWeekLabel: 'أسبوع',
  TranslationsKeys.tkMonthLabel: 'شهر',
  TranslationsKeys.tkCustomLabel: 'مخصص',
  TranslationsKeys.tkViewMoreLabel: 'عرض المزيد',

  // 💳 خدمات البنك - دفع الفواتير
  TranslationsKeys.tkBillPaymentServicesLabel: 'دفع الفواتير',
  TranslationsKeys.tkBillPaymentTelecommunicationServicesLabel: 'الاتصالات',
  TranslationsKeys.tkTopUpLabel: 'شحن رصيد',
  TranslationsKeys.tkBillInquiryLabel: 'كشف فااتورة',
  TranslationsKeys.tkBillPaymentLabel: 'دفع فاتورة',
  TranslationsKeys.tkBillPaymentZainServicesLabel: 'دفع فاتورة زين',
  TranslationsKeys.tkBillPaymentSudaniServicesLabel: 'دفع فاتورة سوداني',
  TranslationsKeys.tkBillPaymentMtnServicesLabel: 'دفع فاتورة MTN',
  TranslationsKeys.tkBillPaymentElectricityServicesLabel: 'الكهرباء',
  TranslationsKeys.tkBillPaymentJamarikServicesLabel: 'الجمارك',
  TranslationsKeys.tkBillPaymentE15ServicesLabel: 'الحكومية',
  TranslationsKeys.tkBillPaymentPortsServicesLabel: 'الموانئ',
  TranslationsKeys.tkMeterNumberLabel: 'رقم العداد',
  TranslationsKeys.tkE15ReceiptNumberLabel: 'رقم إيصال E15',
  TranslationsKeys.tkDeclarantCodeLabel: 'رمز المصرح',
  TranslationsKeys.tkBankCodeLabel: 'رمز البنك',
  TranslationsKeys.tkAllServicesLabel: 'كل الخدمات',

  // 📦 خدمات البنك - خدمات الطلبات
  TranslationsKeys.tkOrdersServiceLabel: 'الطلبات',
  TranslationsKeys.tkTrackOrdersStatusServiceLabel: 'تتبع حالة الطلب',
  TranslationsKeys.tkRequestChequeBookServiceLabel: 'طلب دفتر شيكات',
  TranslationsKeys.tkTrackChequeStatusServiceLabel: 'حالة الشيك',
  TranslationsKeys.tkChequeNumberLabel: 'رقم الشيك',
  TranslationsKeys.tkChequeTypeLabel: 'نوع الشيك',
  TranslationsKeys.tkPagesLabel: 'الصفحات',
  TranslationsKeys.tk25PagesChequeBookLabel: 'دفتر شيكات 25 صفحة',
  TranslationsKeys.tk50PagesChequeBookLabel: 'دفتر شيكات 50 صفحة',
  TranslationsKeys.tkReceivingBranchLabel: 'الفرع المستلم',
  TranslationsKeys.tkNameLabel: 'الاسم',
  'pending': 'قيد الانتظار',
  'rejected': 'مرفوض',
  'approved': 'مقبول',
  'cancelled': 'ملغى',

  // 🛠️ خدمات البنك - خدمات أخرى
  TranslationsKeys.tkOtherServiceLabel: 'أخرى',
  TranslationsKeys.tkProductsServiceLabel: 'المنتجات',
  TranslationsKeys.tkViewExchangeRateServiceLabel: 'أسعار الصرف',
  TranslationsKeys.tkCurrencyLabel: 'العملة',
  TranslationsKeys.tkBuyLabel: 'شراء',
  TranslationsKeys.tkSellLabel: 'بيع',
  TranslationsKeys.tkAverageLabel: 'المتوسط',
  TranslationsKeys.tkSuccessLabel: 'نجاح',
  TranslationsKeys.tkSuccessfulTransactionMsg: 'تمت المعاملة بنجاح',
  TranslationsKeys.tkShareLabel: 'مشاركة',
  TranslationsKeys.tkScreenshotLabel: 'لقطة شاشة',
  TranslationsKeys.tkDoneLabel: 'تم',
  TranslationsKeys.tkAnotherTransactionLabel: 'معاملة اخرى',
  TranslationsKeys.tkDownloadedMsg: 'تم تنزيل لقطة الشاشة بنجاح',

  /// إعدادات
  TranslationsKeys.tkSettingsLabel: 'الإعدادات',
  TranslationsKeys.tkFaqsLabel: 'الأسئلة الشائعة',
  TranslationsKeys.tkTransactionLimitLabel: 'الحدود والرسوم',
  TranslationsKeys.tkAccountInfoNotAvailableMsg: 'بيانات الحساب غير متوفرة',
  TranslationsKeys.tkLogoutLabel: 'تسجيل الخروج',
  TranslationsKeys.tkTransactionCanceledMsg: 'تم إلغاء العملية من قبل المستخدم',
  TranslationsKeys.tkDuplicatedTransactionMsg: 'تم تنفيذ هذه العملية مؤخرًا. هل ترغب في المتابعة مرة أخرى؟',
  TranslationsKeys.tkYesLabel: 'نعم',
  TranslationsKeys.tkNoLabel: 'لا',

  'BeneficiaryType.inside': 'داخل البنك',
  'BeneficiaryType.outside': 'خارج البنك',
  'BeneficiaryType.electricity': 'كهرباء',
  'BeneficiaryType.telecommunication': 'اتصالات',
  'TeleProvider.mtn': 'ام تي ان',
  'TeleProvider.sudani': 'سوداني',
  'TeleProvider.zain': 'زين',

  'TeleServiceType.topUp': 'شحن رصيد',
  'TeleServiceType.payment': 'دفع فاتورة',

  /// استجابة النظام
  "Response_Code": "رمز الاستجابة",
  "Comment": "الملاحظات",
  "Reference_No": "رقم المرجع",
  "Response_Message": "حالة الاستجابة",
  "Tran_DateTime": "تاريخ ووقت العملية",
  "Amount": "المبلغ",
  "Successful": "تمت العملية بنجاح",
  "Biller_ID": "معرف الفاتورة",
  "Currency_Code": "رمز العملة",
  "Customer_Name": "اسم المستلم",
  "Fees": "رسوم المعاملة",
  "NS_RRN": "الرقم المرجعي",
  "APP_RRN": "معرف التطبيق",
};
